examples/twophaseflux/dustyWave/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions [0 0 0 1 0 0 0];
internalField nonuniform List<scalar>
400
(
1.0001256035832737
1.0003760793313585
1.0006247605193845
1.0008706736498643
1.0011128596447252
1.0013503774405235
1.0015823074618311
1.0018077549631668
...
);

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
