examples/twophaseflux/dustyWave/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions [0 1 -1 0 0 0 0];
internalField nonuniform List<vector>
400
(
(0.00031410759078128294 0 0)
(0.00094108313318514315 0 0)
(0.0015643446504023087 0 0)
(0.0021814324139654258 0 0)
(0.0027899110603922927 0 0)
(0.0033873792024529136 0 0)
(0.0039714789063478063 0 0)
(0.0045399049973954674 0 0)
...
);

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
