examples/twophaseflux/dustyWave/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField nonuniform List<scalar>
400
(
1.0004397506270939
1.0013175163864592
1.0021900825105632
1.0030540053795516
1.0039058754845491
1.004742330883434
1.005560070468887
1.0063558669963537
...
);

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
