examples/twophaseflux/dustyWave/constant/ugkwpProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      ugkwpProperties;
}

gpuResidentStrict true;
gpuResidentPureGasOnly false;
gpuResidentDynamicInlet false;
gpuResidentParticleCapacity 408000;
gpuResidentRandomSeed 24681357;
gpuResidentMaxFaceWalkHops 32;
gpuResidentCourantUpdateInterval 100;
gpuResidentMaxDeltaTGrowth 1.0;

// Explicit sealed GPU2.6 L1 particle path.  E1/E2 are validation variants,
// not defaults for these physical reference cases.
gpuCsrCellLocalPath true;
gpuCsrHeavyReduction false;
gpuCsrHeavyCellThreshold 4096;
gpuCsrHeavyTileParticles 4096;
gpuCsrHeavyWorkerBlocksPerSM 4;
gpuCsrWarpAggregatedBinning false;

rhoS 1000000;
dS 0.001;
dMin 0.001;
dMax 0.001;
dSigma 0;
parcelMass 1.0000000000000001e-05;

gpuResidentDragModel constantResponseTime;
gpuResidentParticleResponseTime 0.20000000000000001;
gpuResidentHeatTransferModel RanzMarshall;
gpuResidentParticleThermalResponseTime 1;


gpuResidentCollisionalPressure false;
gpuResidentCollisionalRestitution 1.0;
gpuResidentPressureKickFraction 0.25;
gpuResidentJammingPressure false;
epsSMin 1e-14;
thetaMin 0;
TgasMin 1e-8;
gpuResidentInjectionTheta 0;
gpuResidentInjectionTp 1;

particleWallCoeffs
{
    default 1.0;
}
