examples/twophaseflux/dustyWave/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default Euler;
}
gradSchemes
{
    default Gauss linear;
    grad(phiLS) cellLimited Gauss linear 1;
}
divSchemes
{
    default none;
}
laplacianSchemes
{
    default Gauss linear orthogonal;
}
interpolationSchemes
{
    default linear;
}
snGradSchemes
{
    default orthogonal;
}
wallDist
{
    method meshWave;
}
